/* The title of the button for aborting the scanning of Audio Units. */
"Abort" = "ยกเลิก";

/* alert button
   dialog confirmation */
"OK" = "ตกลง";

/* alert button */
"Abort scan" = "ยกเลิกการสแกน";

/* alert button */
"Continue" = "ดำเนินการต่อ";

/* alert button */
"Continue scan" = "ดำเนินการสแกนต่อ";

/* alert button */
"Ignore" = "ไม่สนใจ";

/* alert button */
"Ignore plug-in" = "ละเว้นบุคคล";

/* alert button */
"Open plug-in graphic interface" = "เปิดอินเทอร์เฟซแบบกราฟิกของปลั๊กอิน";

/* alert button */
"Start Plug-In Manager" = "เริ่มตัวจัดการปลั๊กอิน";

/* alert text */
"Dear ^P user,\nyou have %ld Audio Unit(s) enabled which did not pass the Apple AU validation. This may cause problems and can even crash ^P or lead to data loss! Please check with the manufacturer(s) for updated versions. We recommend disabling these plug-ins in the Plug-In Manager." = "ถึง ^P ผู้ใช้\nคุณมี Audio Unit %ld หน่วยที่เปิดใช้งานซึ่งไม่ผ่านการตรวจสอบความถูกต้อง AU ของ Apple สิ่งนี้อาจทำให้เกิดปัญหาและสามารถทำให้ ^P ล้มเหลวหรือนำไปสู่การสูญเสียข้อมูลได้! โปรดตรวจสอบกับผู้ผลิตสำหรับเวอร์ชั่นอัพเดท ทางเราแนะนำให้ปิดใช้งานปลั๊กอินเหล่านี้ในตัวจัดการปลั๊กอิน";

/* alert text */
"Only Audio Units that have been successfully scanned will be available in ^P.\nScanning will continue next time you launch ^P." = "เฉพาะ Audio Unit ที่การสแกนเสร็จแล้วเท่านั้นจึงจะมีให้ใช้ใน ^P\nการสแกนจะดำเนินการต่อในครั้งต่อไปที่คุณเปิด ^P";

/* alert text */
"The Audio Unit “%@” by “%@” reports that it is not properly authorized to be used on this system.\nPlease check the plug-in’s documentation for more information about its copy protection." = "หน่วยเสียง “%1$@” โดย “%2$@” รายงานว่าไม่ได้รับอนุญาตให้ใช้ในระบบนี้อย่างถูกต้อง\nกรุณาตรวจสอบเอกสารของปลั๊กอินสำหรับข้อมูลเพิ่มเติมเกี่ยวกับการป้องกันการคัดลอกของปลั๊กอินนี้";

/* alert text */
"The Audio Unit “%@” by “%@” reports that it is not properly authorized to be used on this system.\nPlease check the plug-in’s documentation for more information about its copy protection. You may open the plug-in’s graphic interface now for managing copy protection." = "หน่วยเสียง “%1$@” โดย “%2$@” รายงานว่าไม่ได้รับอนุญาตให้ใช้ในระบบนี้อย่างถูกต้อง\nกรุณาตรวจสอบเอกสารของปลั๊กอินสำหรับข้อมูลเพิ่มเติมเกี่ยวกับการป้องกันการคัดลอกของปลั๊กอินนี้ คุณอาจเปิดอินเทอร์เฟซแบบกราฟิกของปลั๊กอินตอนนี้เพื่อจัดการกับการป้องกันการคัดลอกก็ได้";

/* alert text */
"While verifying Audio Unit compatibility, ^P encountered %ld Audio Unit plug-in(s) which did not pass the Apple AU validation. These plug-ins have been excluded from further usage in ^P to prevent possible problems or crashes. You can start the Plug-In Manager now to review the validation results or continue the startup process." = "ในขณะที่ตรวจสอบความเข้ากันได้ของ Audio Unit ^P พบปลั๊กอิน Audio Unit %ld ปลั๊กอินที่ไม่ผ่านการตรวจสอบความถูกต้อง AU ของ Apple ปลั๊กอินเหล่านี้ได้ถูกแยกไม่ให้ใช้ต่อไปใน ^P เพื่อป้องกันปัญหาหรือความล้มเหลวที่อาจเกิดขึ้น คุณสามารถเริ่มต้นตัวจัดการปลั๊กอินได้ตอนนี้เพื่อทบทวนผลลัพธ์การตรวจสอบความถูกต้องหรือดำเนินกระบวนการเริ่มต้นระบบต่อ";

/* alert text */
"^P unexpectedly quit while trying to use the Audio Unit “%@” by “%@”.\nThis plug-in may require an update." = "^P ได้ปิดอย่างกระทันหันในขณะที่พยายามใช้ Audio Unit “%1$@” โดย “%2$@”\nปลั๊กอินนี้อาจต้องการการอัพเดท";

/* alert title */
"An error has occurred with an installed Audio Unit plug-in." = "เกิดข้อผิดพลาดกับปลั๊กอิน Audio Unit ที่ติดตั้งไว้";

/* alert title */
"Audio Unit authorization error." = "การอนุญาต Audio Unit ผิดพลาด";

/* alert title */
"Incompatible Audio Units found." = "พบ Audio Unit ที่ไม่เข้ากัน";

/* alert title */
"You are about to abort the scan process." = "คุณกำลังจะยกเลิกกระบวนการสแกน";

/* alert title */
"You are using incompatible Audio Units." = "คุณกำลังใช้ Audio Unit ที่ไม่เข้ากัน";

/* audio unit type */
"MIDI processor" = "ตัวประมวลผล MIDI";

/* audio unit type */
"MIDI-controlled effect" = "เอฟเฟ็กต์ที่ควบคุมโดย MIDI";

/* audio unit type */
"effect" = "เอฟเฟ็กต์";

/* audio unit type */
"format converter" = "ตัวแปลงรูปแบบ";

/* audio unit type */
"generator" = "ตัวสร้าง";

/* audio unit type */
"instrument" = "เครื่องดนตรี";

/* audio unit type */
"mixer" = "มิกเซอร์";

/* audio unit type */
"offline effect" = "เอฟเฟ็กต์แบบออฟไลน์";

/* audio unit type */
"output unit" = "หน่วยสัญญาณออก";

/* audio unit type */
"panner" = "แพนเนอร์";

/* message while starting up */
"Searching for Audio Unit plug-ins…" = "กำลังค้นหาปลั๊กอิน Audio Unit…";

/* message while starting up */
"Updating information about Audio Unit plug-ins…" = "กำลังอัพเดทข้อมูลเกี่ยวกับปลั๊กอิน Audio Unit…";

/* possible validation result */
"couldn’t be opened" = "ไม่สามารถเปิดได้";

/* possible validation result */
"crashed validation" = "การตรวจสอบความถูกต้องล้มเหลว";

/* possible validation result */
"failed validation" = "การตรวจสอบความถูกต้องล้มเหลว";

/* possible validation result */
"not authorized" = "ไม่ได้รับการรับรอง";

/* possible validation result */
"not validated due to internal error" = "ไม่ได้ตรวจสอบความถูกต้องเนื่องจากข้อผิดพลาดภายใน";

/* possible validation result */
"not yet validated" = "ยังไม่ได้ตรวจสอบความถูกต้อง";

/* possible validation result */
"successfully validated" = "ตรวจสอบความถูกต้องสำเร็จ";

/* progress dialog text */
"Scanning Audio Units (finalized %d of %d)" = "กำลังสแกน Audio Units (เสร็จแล้ว %1$d จาก %2$d)";

/* progress dialog text */
"Scanning Audio Units (finalized %ld of %ld)" = "กำลังสแกน Audio Unit (เสร็จแล้ว %1$ld จาก %2$ld)";

/* used for invalid version numbers */
"invalid" = "ไม่ถูกต้อง";

/* used when value transformer can’t interpret given object */
"unknown" = "ไม่รู้จัก";
